// 0.Напишите программу, которая на вход принимает два числа и проверяет,
// является ли первое число квадратом второго.


System.Console.WriteLine("Введите число: "); 
int userNumber = Convert.ToInt32(Console.ReadLine());

int result = userNumber * userNumber;

System.Console.WriteLine(result);
System.Console.WriteLine(userNumber * userNumber);
